vmux0.0.10-pre/ycsbVMs_ycsb_16vms_bridge-vhost_-1rps_rep0/vm11.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6389 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6389 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-10-03 13:38:51:590 0 sec: 0 operations; est completion in 0 second 
2024-10-03 13:39:01:445 10 sec: 88387 operations; 8838.7 current ops/sec; est completion in 13 hours 29 minutes [READ: Count=43842, Max=19535, Min=77, Avg=109.15, 90=125, 99=190, 99.9=430, 99.99=3107] [UPDATE: Count=44549, Max=22703, Min=75, Avg=107.11, 90=123, 99=203, 99.9=667, 99.99=3005] 
2024-10-03 13:39:11:445 20 sec: 180832 operations; 9244.5 current ops/sec; est completion in 13 hours 11 minutes [READ: Count=46009, Max=7635, Min=81, Avg=108.46, 90=122, 99=155, 99.9=212, 99.99=460] [UPDATE: Count=46432, Max=2103, Min=77, Avg=104.84, 90=119, 99=154, 99.9=207, 99.99=326] 
2024-10-03 13:39:21:445 30 sec: 277911 operations; 9707.9 current ops/sec; est completion in 12 hours 52 minutes [READ: Count=48628, Max=3037, Min=78, Avg=103.23, 90=121, 99=143, 99.9=217, 99.99=409] [UPDATE: Count=48451, Max=406, Min=74, Avg=100.1, 90=118, 99=147, 99.9=215, 99.99=313] 
2024-10-03 13:39:31:445 40 sec: 370923 operations; 9301.2 current ops/sec; est completion in 12 hours 51 minutes [READ: Count=46515, Max=7527, Min=79, Avg=107.67, 90=124, 99=157, 99.9=225, 99.99=403] [UPDATE: Count=46497, Max=2861, Min=76, Avg=104.29, 90=121, 99=153, 99.9=213, 99.99=417] 
2024-10-03 13:39:41:445 50 sec: 466179 operations; 9525.6 current ops/sec; est completion in 12 hours 46 minutes [READ: Count=47648, Max=1389, Min=82, Avg=105.14, 90=120, 99=139, 99.9=184, 99.99=383] [UPDATE: Count=47608, Max=4431, Min=78, Avg=101.94, 90=117, 99=137, 99.9=173, 99.99=230] 
2024-10-03 13:39:51:445 60 sec: 565316 operations; 9913.7 current ops/sec; est completion in 12 hours 38 minutes [READ: Count=49413, Max=5975, Min=79, Avg=101.2, 90=114, 99=138, 99.9=204, 99.99=334] [UPDATE: Count=49724, Max=7059, Min=76, Avg=97.8, 90=111, 99=139, 99.9=202, 99.99=351] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-10-03 13:39:52:457 61 sec: 576045 operations; 10591.31 current ops/sec; est completion in 12 hours 37 minutes [READ: Count=5403, Max=1023, Min=78, Avg=94.01, 90=107, 99=135, 99.9=173, 99.99=365] [CLEANUP: Count=1, Max=1055, Min=1055, Avg=1055, 90=1055, 99=1055, 99.9=1055, 99.99=1055] [UPDATE: Count=5326, Max=2751, Min=75, Avg=91.51, 90=103, 99=131, 99.9=298, 99.99=476] 
[OVERALL], RunTime(ms), 61016
[OVERALL], Throughput(ops/sec), 9440.884358201127
[TOTAL_GCS_Copy], Count, 53
[TOTAL_GC_TIME_Copy], Time(ms), 19
[TOTAL_GC_TIME_%_Copy], Time(%), 0.0311393732791399
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 53
[TOTAL_GC_TIME], Time(ms), 19
[TOTAL_GC_TIME_%], Time(%), 0.0311393732791399
[READ], Operations, 287458
[READ], AverageLatency(us), 105.48139902177013
[READ], MinLatency(us), 77
[READ], MaxLatency(us), 19535
[READ], 95thPercentileLatency(us), 128
[READ], 99thPercentileLatency(us), 155
[READ], Return=OK, 287458
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1055.0
[CLEANUP], MinLatency(us), 1055
[CLEANUP], MaxLatency(us), 1055
[CLEANUP], 95thPercentileLatency(us), 1055
[CLEANUP], 99thPercentileLatency(us), 1055
[UPDATE], Operations, 288587
[UPDATE], AverageLatency(us), 102.36648220467312
[UPDATE], MinLatency(us), 74
[UPDATE], MaxLatency(us), 22703
[UPDATE], 95thPercentileLatency(us), 125
[UPDATE], 99thPercentileLatency(us), 156
[UPDATE], Return=OK, 288587
AUTOTEST_DONE